13/data/attachments/6465e5d959e42461.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_0232ad7c-2ccc-4791-97d9-65ae1a51084c</nif:username>
            <nif:friendToBeAdded>John_lawyer_Friend_2767_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>